{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_31", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 2048], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "bool", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm_93", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_93", "inbound_nodes": [[["input_3", 0, 0, {"mask": ["input_4", 0, 0]}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_124", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_124", "inbound_nodes": [[["lstm_93", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_218", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_218", "inbound_nodes": [[["dropout_124", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_94", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_94", "inbound_nodes": [[["batch_normalization_218", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_125", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_125", "inbound_nodes": [[["lstm_94", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_219", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_219", "inbound_nodes": [[["dropout_125", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_95", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_95", "inbound_nodes": [[["batch_normalization_219", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_126", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_126", "inbound_nodes": [[["lstm_95", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_220", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_220", "inbound_nodes": [[["dropout_126", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_62", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_62", "inbound_nodes": [[["batch_normalization_220", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_127", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_127", "inbound_nodes": [[["dense_62", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_221", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_221", "inbound_nodes": [[["dropout_127", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_63", "trainable": true, "dtype": "float32", "units": 6, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_63", "inbound_nodes": [[["batch_normalization_221", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["dense_63", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "batch_normalization_218/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_218/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_218/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_218/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_219/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_219/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_219/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_219/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_220/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_220/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_220/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_220/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_221/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_221/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_221/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_221/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "dense_62/kernel", "shape": [64, 16], "dtype": "float32"}, {"name": "dense_62/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_63/kernel", "shape": [16, 6], "dtype": "float32"}, {"name": "dense_63/bias", "shape": [6], "dtype": "float32"}, {"name": "lstm_93/lstm_cell/kernel", "shape": [2048, 1024], "dtype": "float32"}, {"name": "lstm_93/lstm_cell/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_93/lstm_cell/bias", "shape": [1024], "dtype": "float32"}, {"name": "lstm_94/lstm_cell/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "lstm_94/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_94/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_95/lstm_cell/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "lstm_95/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm_95/lstm_cell/bias", "shape": [256], "dtype": "float32"}]}]}