{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"input_layer_67": {"name": "input_layer_67:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "132"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_269_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_269_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_270_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_270_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_271_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_271_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_272_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_272_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "132"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_67", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "132"}]}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1/num_elements"], "attr": {"_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/transpose", "op": "Transpose", "input": ["input_layer_67", "StatefulPartitionedCall/functional_10_1/lstm_67_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/Shape", "op": "Shape", "input": ["input_layer_67"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/transpose", "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"_has_manual_control_dependencies": {"b": true}, "shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/Shape", "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice/stack", "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice", "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice", "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros/packed", "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1/packed", "StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xMF8xL2xzdG1fNjdfMS93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xMF8xL2xzdG1fNjdfMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/Max", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xMF8xL2xzdG1fNjdfMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xMF8xL2xzdG1fNjdfMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/loop_counter", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xMF8xL2xzdG1fNjdfMS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xMF8xL2xzdG1fNjdfMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/time", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xMF8xL2xzdG1fNjdfMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_23", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xMF8xL2xzdG1fNjdfMS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_24", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xMF8xL2xzdG1fNjdfMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_25", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopControlInputs/_26"], "attr": {"_has_manual_control_dependencies": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xMF8xL2xzdG1fNjdfMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_20", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_55"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_22", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_57"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_17", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_52"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_19", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_54"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_16", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_51"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_21", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_56"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_18", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_53"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/input_control_node/_58", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_23", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_24", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_25", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_27", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_28", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_29", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_30", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_31", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_32", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/functional_10_1/lstm_67_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_27", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_28", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/input_control_node/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/functional_10_1/lstm_67_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/input_control_node/_58"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/functional_10_1/lstm_67_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_29", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/functional_10_1/lstm_67_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/functional_10_1/lstm_67_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/functional_10_1/lstm_67_1/while/Less_1", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/functional_10_1/lstm_67_1/while/Less"]}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopCond/_34", "op": "LoopCond", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/cond/_14/functional_10_1/lstm_67_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/Max_switch/_36", "op": "Switch", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_28", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_30", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/loop_counter_switch/_35", "op": "Switch", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_27", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_33", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/time_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_29", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_32", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/merge/_31", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/LoopCond/_34"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_44", "op": "Exit", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/Max_switch/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1_switch/_38"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_43", "op": "Exit", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/loop_counter_switch/_35"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/loop_body_control/_42", "op": "Identity", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/loop_counter_switch/_35:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor_switch/_41"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/time_switch/_37"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_switch/_39"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_46", "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "1"}}}, {"name": "Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/Max_switch/_36", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor_switch/_41", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1_switch/_38", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/time_switch/_37", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/loop_body_control/_42", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1_switch/_40", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_switch/_39", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_23", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_24", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_25"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3/stack", "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3/stack_1", "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_23", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "132"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_24", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/enter/_25", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_269_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3", "StatefulPartitionedCall/functional_10_1/dense_269_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_10_1/dense_269_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/loop_counter_switch/_35:1", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/time_switch/_37:1", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor_switch/_41:1", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/time_switch/_37:1", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_switch/_39:1", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/output_control_node/_91", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_270_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_10_1/dense_269_1/Relu", "StatefulPartitionedCall/functional_10_1/dense_270_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_10_1/dense_270_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_57", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor_switch/_41:1", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/output_control_node/_91", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_52", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/Max_switch/_36:1", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/output_control_node/_91", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/NoOp", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/input_control_node/_70"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_51", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/add_1", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/output_control_node/_91", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_53", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/add", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/output_control_node/_91", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_271_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_10_1/dense_270_1/Relu", "StatefulPartitionedCall/functional_10_1/dense_271_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_10_1/dense_271_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_272_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_10_1/dense_271_1/Relu", "StatefulPartitionedCall/functional_10_1/dense_272_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_10_1/dense_272_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/split", "op": "Split", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/split/split_dim", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "StatefulPartitionedCall/functional_10_1/dense_272_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_10_1/dense_272_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_10_1/dense_272_1/Softmax", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_49", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_48", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_43", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_44", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_45", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_46", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/exit/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Sigmoid_1", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/zeros_1_switch/_40:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Sigmoid", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/mul", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_56", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/add_2", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/output_control_node/_91", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Sigmoid_2", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1_switch/_38:1", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/TensorArrayV2Write/TensorListSetItem/index", "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/mul_2"], "attr": {"resize_if_index_out_of_bounds": {"b": false}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_55", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/lstm_cell_1/mul_2", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/output_control_node/_91", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/next_iteration/_54", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/TensorArrayV2Write/TensorListSetItem", "^Func/StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/output_control_node/_91", "^StatefulPartitionedCall/functional_10_1/lstm_67_1/while/body/_15/functional_10_1/lstm_67_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_10_1/dense_269_1/Cast/ReadVariableOp", "shape": [32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_10_1/dense_269_1/Add/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_10_1/dense_270_1/Cast/ReadVariableOp", "shape": [64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_10_1/dense_270_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_10_1/dense_271_1/Cast/ReadVariableOp", "shape": [128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_10_1/dense_271_1/Add/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_10_1/dense_272_1/Cast/ReadVariableOp", "shape": [256, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_10_1/dense_272_1/Add/ReadVariableOp", "shape": [6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/Max", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/time", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_1", "shape": [132, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [32, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_10_1/lstm_67_1/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": 