{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"input_layer_1": {"name": "input_layer_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "132"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "132"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_6_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_6_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_8_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_8_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_7_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_7_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_8_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_8_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_9_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_9_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "132"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Relu", "op": "_FusedMatMul", "input": ["input_layer_1", "StatefulPartitionedCall/sequential_1_1/dense_6_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_6_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_6_1/Relu", "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_6_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_7_1/Relu", "StatefulPartitionedCall/sequential_1_1/batch_normalization_6_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_6_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_6_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_6_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_8_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_6_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_1_1/dense_8_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_8_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_7_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_8_1/Relu", "StatefulPartitionedCall/sequential_1_1/batch_normalization_7_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_7_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_7_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_7_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_7_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_1_1/dense_9_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_9_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_8_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_9_1/Relu", "StatefulPartitionedCall/sequential_1_1/batch_normalization_8_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_8_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_8_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_8_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_8_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_1_1/dense_10_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_10_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_9_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_10_1/Relu", "StatefulPartitionedCall/sequential_1_1/batch_normalization_9_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_9_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_9_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_9_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_9_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_1_1/dense_11_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_11_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1_1/dense_11_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/dense_11_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Cast/ReadVariableOp", "shape": [132, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Add/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "shape": [32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_6_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_6_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_8_1/Cast/ReadVariableOp", "shape": [64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_8_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_7_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_7_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Cast/ReadVariableOp", "shape": [128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_9_1/Add/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_8_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_8_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Cast/ReadVariableOp", "shape": [256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_10_1/Add/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_9_1/batchnorm/mul", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_9_1/batchnorm/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Cast/ReadVariableOp", "shape": [512, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_11_1/Add/ReadVariableOp", "shape": [6], "dtype": "float32"}]}]}